In [1]:
import numpy as np
import pandas as pd

In [2]:
k =pd.Series(["Arpan","Karthik","Vikram"],index=["A","K","V"])
k

A      Arpan
K    Karthik
V     Vikram
dtype: object

In [3]:
dict1 = {"Reliance":10000,"Canara_Rebeco":12543,"Aditya_Birla":564536, "Tata":998478}
#x = pd.Series(dict1,index=["Aditya_Birla","Canara_Rebeco","Reliance","Tata"])#giving oreder
x=pd.Series(dict1)
x

Reliance          10000
Canara_Rebeco     12543
Aditya_Birla     564536
Tata             998478
dtype: int64

In [4]:
import calendar as cal
name_of_month = [cal.month_name[i] for i in np.arange(1,12)]
month_of_year = pd.Series(np.arange(1,12), index=name_of_month)
month_of_year

January       1
February      2
March         3
April         4
May           5
June          6
July          7
August        8
September     9
October      10
November     11
dtype: int32

In [5]:
dict1 = {'R':10000,'C':12543,'A':564536, 'T':998478}
#x = pd.Series(dict1,index=["Aditya_Birla","Canara_Rebeco","Reliance","Tata"])#giving oreder
x=pd.Series(dict1)
x

R     10000
C     12543
A    564536
T    998478
dtype: int64

In [6]:
x.sort_index()

A    564536
C     12543
R     10000
T    998478
dtype: int64

In [7]:
##operation on series
x["A"]=10000000000

In [8]:
x

R          10000
C          12543
A    10000000000
T         998478
dtype: int64

In [9]:
dict1 = {'R':10000,'C':12543,'A':564536, 'T':998478}
#x = pd.Series(dict1,index=["Aditya_Birla","Canara_Rebeco","Reliance","Tata"])#giving oreder
x=pd.Series(dict1)
x

R     10000
C     12543
A    564536
T    998478
dtype: int64

In [10]:
x[x>10000]

C     12543
A    564536
T    998478
dtype: int64

In [11]:
np.mean(x)

396389.25

In [12]:
#multiplication
x = np.array([1,2,3,4])*pd.Series([1,2,3,4])
x

0     1
1     4
2     9
3    16
dtype: int64

In [13]:
a = x[:-1]
b = x[1:]
add = a+b
#x = pd.Series(add)
add

0     NaN
1     8.0
2    18.0
3     NaN
dtype: float64

In [14]:
np.sqrt(x)

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

# creating dataframe

In [22]:
dict1 =pd.DataFrame()

In [16]:
ke = pd.Series({"Reliance":"Sunaday","Canara_Rebeco":"Monday","Aditya_Birla":"Tuesday", "Tata":"Wednesday"})

In [17]:
ke

Reliance           Sunaday
Canara_Rebeco       Monday
Aditya_Birla       Tuesday
Tata             Wednesday
dtype: object

In [18]:
#create a dectionary of series
dict1 ={"Reliance":pd.Series([10000,1287,53653,7376,676715,61753,45254]),"Canara_Rebeco":pd.Series([12543,63562,785786,84867,78482764,26476,62526])}
dict1

{'Reliance': 0     10000
 1      1287
 2     53653
 3      7376
 4    676715
 5     61753
 6     45254
 dtype: int64, 'Canara_Rebeco': 0       12543
 1       63562
 2      785786
 3       84867
 4    78482764
 5       26476
 6       62526
 dtype: int64}

In [19]:
x = pd.DataFrame(dict1)

In [20]:
type(x)

pandas.core.frame.DataFrame

In [21]:
x

   Reliance  Canara_Rebeco
0     10000          12543
1      1287          63562
2     53653         785786
3      7376          84867
4    676715       78482764
5     61753          26476
6     45254          62526

In [ ]:
dict1 ={"Reliance":[10000,1287,53653,7376,676715,61753,45254],"Canara_Rebeco":[12543,63562,785786,84867,78482764,26476,62526]}
dict1

In [ ]:
pd.DataFrame(dict1)

In [ ]:
k=[10000,1287,53653,7376,676715,61753,45254]
pd.DataFrame(k,columns=["ARPAN"],index=["K","A","R","T","H","I","K"])

In [ ]:
#structured array
df3 = np.zeros((4,),dtype = [("Name","U25"),("Gender","U10")])#creating empty dataframe
df3

In [ ]:
df3["Name"]=["RAM","ARPAN","KARTHIK","VIKRAM"]#or can same using df[:]=[("name",Gender),..............]
df3["Gender"]=["Male","Female","Male","Tran_Gender"]
df3

In [ ]:
pd.DataFrame(df3)

In [ ]:
#creating a dataframe from a series
dict1 = {"Reliance":10000,"Canara_Rebeco":12543,"Aditya_Birla":564536, "Tata":998478}
ser2 = pd.Series(dict1,index=["Aditya_Birla","Canara_Rebeco","Tata","Reliance"])

In [ ]:
pd.DataFrame(ser2)

In [2]:
dict1 = {"Reliance":10000,"Canara_Rebeco":12543,"Aditya_Birla":564536, "Tata":998478}
dict2 = {'Reliance':7765,'Canara_Rebeco':7636556,'Aditya_Birla':4254, 'Tata':898}
ser2 = pd.Series(dict1)
st3 = pd.Series(dict2)
ser4 = pd.concat([ser2,st3],axis=1)
#ser5=pd.DataFrame(ser4,columns=["stock_value1","stock_value2"])
ser4

                    0        1
Reliance        10000     7765
Canara_Rebeco   12543  7636556
Aditya_Birla   564536     4254
Tata           998478      898

In [3]:
ser4.columns=["stock_value1","stock_value2"]
ser4

               stock_value1  stock_value2
Reliance              10000          7765
Canara_Rebeco         12543       7636556
Aditya_Birla         564536          4254
Tata                 998478           898

In [3]:
dict1 = {"Reliance":10000,"Canara_Rebeco":12543,"Aditya_Birla":564536, "Tata":998478}
dict2 = {'Reliance':7765,'Canara_Rebeco':7636556,'Aditya_Birla':4254, 'Tata':898}

In [1]:
import pandas as pd
ser2 = pd.Series(dict1,index = ['Reliance','Canara_Rebeco', 'Aditya_Birla','Tata'])
st3 = pd.Series(dict2,index = ['Reliance','Canara_Rebeco', 'Aditya_Birla','Tata'])

NameError: name 'dict1' is not defined

In [5]:
ser4 = pd.concat([ser2,st3],axis=1)
ser4

                    0        1
Reliance        10000     7765
Canara_Rebeco   12543  7636556
Aditya_Birla   564536     4254
Tata           998478      898

In [9]:
ser4.stock_value1.value_counts()

564536    1
12543     1
998478    1
10000     1
Name: stock_value1, dtype: int64

In [1]:
import pandas as pd
dict1 =pd.Series({"Reliance":10000,"Canara_Rebeco":12543,"Aditya_Birla":564536, "Tata":998478})
dict2 =pd.Series({'Reliance':7765,'Canara_Rebeco':7636556,'Aditya_Birla':4254, 'Tata':898})

ser4 = pd.concat([dict1,dict2],axis=1)
ser5=pd.DataFrame(ser4,columns=("stockvalue1","stockvalue2"))
ser5

               stockvalue1  stockvalue2
Reliance               NaN          NaN
Canara_Rebeco          NaN          NaN
Aditya_Birla           NaN          NaN
Tata                   NaN          NaN

# ------------------------

In [11]:
#operation on Dataframe
ser4.stock_value1

Reliance          10000
Canara_Rebeco     12543
Aditya_Birla     564536
Tata             998478
Name: stock_value1, dtype: int64

In [5]:
type(ser4.stock_value1)

pandas.core.series.Series

In [12]:
ser4[:2]

               stock_value1  stock_value2
Reliance              10000          7765
Canara_Rebeco         12543       7636556

In [30]:
ser4

               stock_value1  stock_value2
Reliance              10000          7765
Canara_Rebeco         12543       7636556
Aditya_Birla         564536          4254
Tata                 998478           898

In [19]:
ser4["stock_value1"]["Tata"]

998478

In [32]:
#del df[name column] for deleting
ser4.insert(3,"stock_value3",3000)

IndexError: index 3 is out of bounds for axis 0 with size 2

In [33]:
ser4

               stock_value1  stock_value2
Reliance              10000          7765
Canara_Rebeco         12543       7636556
Aditya_Birla         564536          4254
Tata                 998478           898

In [76]:
oil_data = {"France":{"2015-Q1":99,"2015-Q2":104.1,"2015-Q3":304.0,"2015-Q4":498},
           "Germany":{"2015-Q1":135.1,"2015-Q2":104,"2015-Q3":304.0,"2015-Q4":560.0},
           "Poland":{"2015-Q1":203.1,"2015-Q2":104.1,"2015-Q3":650.4,"2015-Q4":111}}
oil_data

{'France': {'2015-Q1': 99, '2015-Q2': 104.1, '2015-Q3': 304.0, '2015-Q4': 498},
 'Germany': {'2015-Q1': 135.1,
  '2015-Q2': 104,
  '2015-Q3': 304.0,
  '2015-Q4': 560.0},
 'Poland': {'2015-Q1': 203.1,
  '2015-Q2': 104.1,
  '2015-Q3': 650.4,
  '2015-Q4': 111}}

In [77]:
oil_df = pd.DataFrame(oil_data)
oil_df

         France  Germany  Poland
2015-Q1    99.0    135.1   203.1
2015-Q2   104.1    104.0   104.1
2015-Q3   304.0    304.0   650.4
2015-Q4   498.0    560.0   111.0

In [38]:
oil_df = pd.DataFrame.from_dict(oil_data)
oil_df

         France  Germany  Poland
2015-Q1   100.1    135.1   203.1
2015-Q2   104.1    104.0   104.1
2015-Q3   304.0    304.0   650.4
2015-Q4   498.0    560.0   111.0

In [39]:
oil_df[["Poland","Germany","France"]]

         Poland  Germany  France
2015-Q1   203.1    135.1   100.1
2015-Q2   104.1    104.0   104.1
2015-Q3   650.4    304.0   304.0
2015-Q4   111.0    560.0   498.0

In [40]:
oil_df[::-1]#reverse complete datframe

         France  Germany  Poland
2015-Q4   498.0    560.0   111.0
2015-Q3   304.0    304.0   650.4
2015-Q2   104.1    104.0   104.1
2015-Q1   100.1    135.1   203.1

In [44]:
oil_df.France[::-1][::-1][::-1][::-1][::-1][::-1][::-1]

2015-Q4    498.0
2015-Q3    304.0
2015-Q2    104.1
2015-Q1    100.1
Name: France, dtype: float64

In [50]:
#label - oriented indexing
snow_data = {"Months":["january","February","March","April","May","Jun"],
            "Avg_low_temp":[23,43,32,65,67,22],
            "Avg_price":[12.3,34,34.5,76,45,21],
            "Avg_snowday":[3.0,6.0,5.0,2.0,3.3,4.5]}
snow_data_df = pd.DataFrame(snow_data,index=snow_data["Months"])#making months as index
snow_data_df

            Months  Avg_low_temp  Avg_price  Avg_snowday
january    january            23       12.3          3.0
February  February            43       34.0          6.0
March        March            32       34.5          5.0
April        April            65       76.0          2.0
May            May            67       45.0          3.3
Jun            Jun            22       21.0          4.5

In [51]:
snow_data_df.loc["january"]

Months          january
Avg_low_temp         23
Avg_price          12.3
Avg_snowday           3
Name: january, dtype: object

In [59]:
snow_data_df.loc["january",:]#

Months          january
Avg_low_temp         23
Avg_price          12.3
Avg_snowday           3
Name: january, dtype: object

In [60]:
snow_data_df.loc[:,"Avg_low_temp"]#accessing column using loc

january     23
February    43
March       32
April       65
May         67
Jun         22
Name: Avg_low_temp, dtype: int64

In [62]:
snow_data_df.loc["May"]

Months          May
Avg_low_temp     67
Avg_price        45
Avg_snowday     3.3
Name: May, dtype: object

In [63]:
snow_data_df.loc[:,["Avg_low_temp","Avg_snowday"]]#accessing multiple columns using loc

          Avg_low_temp  Avg_snowday
january             23          3.0
February            43          6.0
March               32          5.0
April               65          2.0
May                 67          3.3
Jun                 22          4.5

In [67]:
snow_data_df.loc["May"]["Avg_low_temp"]# for loc index should come first

67

In [90]:
oil_df

         France  Germany  Poland
2015-Q1    99.0    135.1   203.1
2015-Q2   104.1    104.0   104.1
2015-Q3   304.0    304.0   650.4
2015-Q4   498.0    560.0   111.0

In [93]:
#findout column where values are greater than 150
oil_df[oil_df.loc[:]>150]

         France  Germany  Poland
2015-Q1     NaN      NaN   203.1
2015-Q2     NaN      NaN     NaN
2015-Q3   304.0    304.0   650.4
2015-Q4   498.0    560.0     NaN

In [99]:
oil_df[:1]>150

         France  Germany  Poland
2015-Q1   False    False    True

In [100]:
oil_df.loc[:,oil_df.loc["2015-Q1"]>150]

         Poland
2015-Q1   203.1
2015-Q2   104.1
2015-Q3   650.4
2015-Q4   111.0

# ------------------

In [102]:
oil_df

         France  Germany  Poland
2015-Q1    99.0    135.1   203.1
2015-Q2   104.1    104.0   104.1
2015-Q3   304.0    304.0   650.4
2015-Q4   498.0    560.0   111.0

In [109]:
new = {"x":list(range(1,5)),"y":list(range(6,10)),"z":list(range(12,16))}
new_df = pd.DataFrame(new,index=[3,8,2,4])

In [110]:
new_df

   x  y   z
3  1  6  12
8  2  7  13
2  3  8  14
4  4  9  15

In [114]:
#iloc will return only the position
new_df.iloc[3]

x     4
y     9
z    15
Name: 4, dtype: int64

In [119]:
new_df.loc[3]#it is purely a level base indexing

x     1
y     6
z    12
Name: 3, dtype: int64

In [128]:
new_df.iloc[2][0]

3

In [127]:
new_df.loc[2][0]

3

# ----------------------------------------------------

In [130]:
stock_data = pd.read_csv("stock_index_prices.csv")
stock_data

   TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
0   2014/02/21      open  4282.17  1841.07       1166.25
1   2014/02/21     close  4263.41  1836.25       1164.63
2   2014/02/21      high  4284.85  1846.13       1168.43
3   2014/02/24      open  4273.32  1836.78       1166.74
4   2014/02/24     close  4292.97  1847.61       1174.55
5   2014/02/24      high  4311.13  1858.71       1180.29
6   2014/02/25      open  4298.48  1847.66       1176.00
7   2014/02/25     close  4287.59  1845.12       1173.95
8   2014/02/25      high  4307.51  1852.91       1179.43
9   2014/02/26      open  4300.45  1845.79       1176.11
10  2014/02/26     close  4292.06  1845.16       1181.72
11  2014/02/26      high  4316.82  1852.65       1188.06
12  2014/02/27      open  4291.47  1844.90       1179.28
13  2014/02/27     close  4318.93  1854.29       1187.94
14  2014/02/27      high  4322.46  1854.53       1187.94
15  2014/02/28      open  4323.52  1855.12       1189.19
16  2014/02/28     close  4308.12  1859.45       1183.03
17  2014/02/28      high  4342.59  1867.92       1193.50

In [131]:
stock_data.head()4300

  TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
0  2014/02/21      open  4282.17  1841.07       1166.25
1  2014/02/21     close  4263.41  1836.25       1164.63
2  2014/02/21      high  4284.85  1846.13       1168.43
3  2014/02/24      open  4273.32  1836.78       1166.74
4  2014/02/24     close  4292.97  1847.61       1174.55

In [147]:
stock_data[(stock_data["PriceType"]=="close") & (stock_data["Nasdaq"]>4300)]

   TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
13  2014/02/27     close  4318.93  1854.29       1187.94
16  2014/02/28     close  4308.12  1859.45       1183.03

In [ ]:
#all rows where price tag high nasdaq <4300
#isin and any and all
#where,mask
#

In [148]:
stock_data[(stock_data["PriceType"]=="high") & (stock_data["Nasdaq"]<4300)]

  TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
2  2014/02/21      high  4284.85  1846.13       1168.43

# --------------------------